[Killed] BlockStatement
src/engine/engine.service.ts:10:35
 export class EngineService {
   private boards = new Map<string, Chess>();
 
-  newGame(gameId: string): string {
-    const chess = new Chess();
-    this.boards.set(gameId, chess);
-    return chess.fen();
-  }
+  newGame(gameId: string): string {}
 
   makeMove(gameId: string, moveRequest: IMoveRequest): IMove {
killedBy: EngineService newGame should create a new chess game and return initial FEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "initial fen"
Received: undefined

[Killed] BlockStatement
src/engine/engine.service.ts:17:9
   }
 
   makeMove(gameId: string, moveRequest: IMoveRequest): IMove {
-    try {
-      const chess = this.boards.get(gameId);
-      if (!chess) return { valid: false };
-
-      const result = chess.move(moveRequest);
-
-      const status = this.getGameStatus(chess);
-
-      const isGameOver = this.isGameOver(status);
-
-      return {
-        valid: true,
-        details: {
-          from: result.from,
-          to: result.to,
-          san: result.san,
-          fen: chess.fen(),
-          status,
-          isGameOver,
-        },
-      };
-    } catch {
+    try {} catch {
       return { valid: false };
     }
killedBy: EngineService makeMove should successfully make a valid move
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] BooleanLiteral
src/engine/engine.service.ts:19:11
   makeMove(gameId: string, moveRequest: IMoveRequest): IMove {
     try {
       const chess = this.boards.get(gameId);
-      if (!chess) return { valid: false };
+      if (chess) return { valid: false };
 
       const result = chess.move(moveRequest);
killedBy: EngineService makeMove should successfully make a valid move
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/engine/engine.service.ts:19:11
   makeMove(gameId: string, moveRequest: IMoveRequest): IMove {
     try {
       const chess = this.boards.get(gameId);
-      if (!chess) return { valid: false };
+      if (true) return { valid: false };
 
       const result = chess.move(moveRequest);
killedBy: EngineService makeMove should successfully make a valid move
statusReason: Error: expect(received).toBeTruthy()

Received: false

[NoCoverage] BlockStatement
src/engine/engine.service.ts:38:13
           isGameOver,
         },
       };
-    } catch {
-      return { valid: false };
-    }
+    } catch {}
   }
 

[NoCoverage] BooleanLiteral
src/engine/engine.service.ts:39:23
         },
       };
     } catch {
-      return { valid: false };
+      return { valid: true };
     }
   }

[Survived] BlockStatement
src/engine/engine.service.ts:43:28
     }
   }
 
-  undoMove(gameId: string) {
-    const chess = this.boards.get(gameId);
-    if (chess) {
-      chess.undo();
-    }
-  }
+  undoMove(gameId: string) {}
 
   private getGameStatus(chess: Chess): GameStatus {

[Killed] ConditionalExpression
src/engine/engine.service.ts:45:9
 
   undoMove(gameId: string) {
     const chess = this.boards.get(gameId);
-    if (chess) {
+    if (true) {
       chess.undo();
     }
killedBy: EngineService undoMove should do nothing when game not found
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'undo')"

      115 |         } else {
      116 |           stryCov_9fa48("20");
    > 117 |           chess.undo();

[Survived] BlockStatement
src/engine/engine.service.ts:45:16
 
   undoMove(gameId: string) {
     const chess = this.boards.get(gameId);
-    if (chess) {
-      chess.undo();
-    }
+    if (chess) {}
   }
 

[Killed] BlockStatement
src/engine/engine.service.ts:50:51
     }
   }
 
-  private getGameStatus(chess: Chess): GameStatus {
-    if (chess.isCheckmate()) return 'checkmate';
-    if (chess.isStalemate()) return 'stalemate';
-    if (chess.isDraw()) return 'draw';
-    return 'playing';
-  }
+  private getGameStatus(chess: Chess): GameStatus {}
 
   private isGameOver(status: GameStatus): boolean {
killedBy: EngineService makeMove should successfully make a valid move
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "playing"
Received: undefined

[Killed] ConditionalExpression
src/engine/engine.service.ts:51:9
   }
 
   private getGameStatus(chess: Chess): GameStatus {
-    if (chess.isCheckmate()) return 'checkmate';
+    if (false) return 'checkmate';
     if (chess.isStalemate()) return 'stalemate';
     if (chess.isDraw()) return 'draw';
killedBy: EngineService getGameStatus getGameStatus should return checkmate status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "checkmate"
Received: "playing"

[Killed] ConditionalExpression
src/engine/engine.service.ts:51:9
   }
 
   private getGameStatus(chess: Chess): GameStatus {
-    if (chess.isCheckmate()) return 'checkmate';
+    if (true) return 'checkmate';
     if (chess.isStalemate()) return 'stalemate';
     if (chess.isDraw()) return 'draw';
killedBy: EngineService makeMove should successfully make a valid move
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "playing"
Received: "checkmate"

[Killed] ConditionalExpression
src/engine/engine.service.ts:52:9
 
   private getGameStatus(chess: Chess): GameStatus {
     if (chess.isCheckmate()) return 'checkmate';
-    if (chess.isStalemate()) return 'stalemate';
+    if (true) return 'stalemate';
     if (chess.isDraw()) return 'draw';
     return 'playing';
killedBy: EngineService makeMove should successfully make a valid move
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "playing"
Received: "stalemate"

[Killed] ConditionalExpression
src/engine/engine.service.ts:52:9
 
   private getGameStatus(chess: Chess): GameStatus {
     if (chess.isCheckmate()) return 'checkmate';
-    if (chess.isStalemate()) return 'stalemate';
+    if (false) return 'stalemate';
     if (chess.isDraw()) return 'draw';
     return 'playing';
killedBy: EngineService getGameStatus getGameStatus should return stalemate status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stalemate"
Received: "playing"

[Killed] ConditionalExpression
src/engine/engine.service.ts:53:9
   private getGameStatus(chess: Chess): GameStatus {
     if (chess.isCheckmate()) return 'checkmate';
     if (chess.isStalemate()) return 'stalemate';
-    if (chess.isDraw()) return 'draw';
+    if (false) return 'draw';
     return 'playing';
   }
killedBy: EngineService getGameStatus getGameStatus should return draw status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "draw"
Received: "playing"

[Killed] ConditionalExpression
src/engine/engine.service.ts:53:9
   private getGameStatus(chess: Chess): GameStatus {
     if (chess.isCheckmate()) return 'checkmate';
     if (chess.isStalemate()) return 'stalemate';
-    if (chess.isDraw()) return 'draw';
+    if (true) return 'draw';
     return 'playing';
   }
killedBy: EngineService makeMove should successfully make a valid move
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "playing"
Received: "draw"

[Killed] BlockStatement
src/engine/engine.service.ts:57:51
     return 'playing';
   }
 
-  private isGameOver(status: GameStatus): boolean {
-    return ['stalemate', 'draw', 'checkmate'].includes(status);
-  }
+  private isGameOver(status: GameStatus): boolean {}
 }
 
killedBy: EngineService isGameOver should correctly identify game over states
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] StringLiteral
src/engine/engine.service.ts:58:34
   }
 
   private isGameOver(status: GameStatus): boolean {
-    return ['stalemate', 'draw', 'checkmate'].includes(status);
+    return ['stalemate', 'draw', ""].includes(status);
   }
 }
killedBy: EngineService isGameOver should correctly identify game over states
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] StringLiteral
src/engine/engine.service.ts:58:26
   }
 
   private isGameOver(status: GameStatus): boolean {
-    return ['stalemate', 'draw', 'checkmate'].includes(status);
+    return ['stalemate', "", 'checkmate'].includes(status);
   }
 }
killedBy: EngineService isGameOver should correctly identify game over states
statusReason: Error: expect(received).toBeTruthy()

Received: false
