[NoCoverage] BlockStatement
src/game/game.gateway.ts:42:5
   async handleCreate(
     @ConnectedSocket() client: Socket,
     @MessageBody() email: string,
-  ) {
-    console.log('here');
-    const game = await this.gameService.createGame(email, client.id);
-    console.log('here 2');
-    this.gameEvent.emitGameCreated(client, game);
-  }
+  ) {}
 
   @Roles('Player')

[NoCoverage] BlockStatement
src/game/game.gateway.ts:54:5
   async handleJoin(
     @MessageBody() joinRequest: { gameId: string; email: string },
     @ConnectedSocket() client: Socket,
-  ) {
-    const { gameId, email } = joinRequest;
-
-    const game = await this.gameService.joinGame(gameId, email, client.id);
-    if (!game) {
-      throw new GameNotFoundException(gameId);
-    }
-    const opponent = this.userService.getOpponent(game.players, email);
-    const opponentSocketId = opponent?.currentSocketId;
-    if (!opponentSocketId) {
-      throw new OpponentNotFoundException();
-    }
-    this.gameEvent.emitGameJoined(client, game, opponentSocketId, gameId);
-  }
+  ) {}
 
   @Roles('Player')

[NoCoverage] BlockStatement
src/game/game.gateway.ts:58:16
     const { gameId, email } = joinRequest;
 
     const game = await this.gameService.joinGame(gameId, email, client.id);
-    if (!game) {
-      throw new GameNotFoundException(gameId);
-    }
+    if (!game) {}
     const opponent = this.userService.getOpponent(game.players, email);
     const opponentSocketId = opponent?.currentSocketId;

[NoCoverage] BooleanLiteral
src/game/game.gateway.ts:58:9
     const { gameId, email } = joinRequest;
 
     const game = await this.gameService.joinGame(gameId, email, client.id);
-    if (!game) {
+    if (game) {
       throw new GameNotFoundException(gameId);
     }

[NoCoverage] OptionalChaining
src/game/game.gateway.ts:62:30
       throw new GameNotFoundException(gameId);
     }
     const opponent = this.userService.getOpponent(game.players, email);
-    const opponentSocketId = opponent?.currentSocketId;
+    const opponentSocketId = opponent.currentSocketId;
     if (!opponentSocketId) {
       throw new OpponentNotFoundException();

[NoCoverage] ConditionalExpression
src/game/game.gateway.ts:63:9
     }
     const opponent = this.userService.getOpponent(game.players, email);
     const opponentSocketId = opponent?.currentSocketId;
-    if (!opponentSocketId) {
+    if (false) {
       throw new OpponentNotFoundException();
     }

[NoCoverage] ConditionalExpression
src/game/game.gateway.ts:63:9
     }
     const opponent = this.userService.getOpponent(game.players, email);
     const opponentSocketId = opponent?.currentSocketId;
-    if (!opponentSocketId) {
+    if (true) {
       throw new OpponentNotFoundException();
     }

[NoCoverage] BlockStatement
src/game/game.gateway.ts:74:5
   async handleLeave(
     @MessageBody() leaveRequest: { gameId: string; email: string },
     @ConnectedSocket() client: Socket,
-  ) {
-    const { gameId, email } = leaveRequest;
-    const game = await this.gameService.getGameWithPlayers(gameId);
-
-    if (!game) {
-      throw new GameNotFoundException(gameId);
-    }
-    const opponent = this.userService.getOpponent(game.players, email);
-    const opponentSocketId = opponent?.currentSocketId;
-    if (!opponentSocketId) {
-      return;
-    }
-    game.winner = opponent;
-    await game.save();
-    this.gameEvent.emitLeave(client, opponent);
-  }
+  ) {}
 
   @Roles('Player')

[NoCoverage] BlockStatement
src/game/game.gateway.ts:78:16
     const { gameId, email } = leaveRequest;
     const game = await this.gameService.getGameWithPlayers(gameId);
 
-    if (!game) {
-      throw new GameNotFoundException(gameId);
-    }
+    if (!game) {}
     const opponent = this.userService.getOpponent(game.players, email);
     const opponentSocketId = opponent?.currentSocketId;

[NoCoverage] ConditionalExpression
src/game/game.gateway.ts:78:9
     const { gameId, email } = leaveRequest;
     const game = await this.gameService.getGameWithPlayers(gameId);
 
-    if (!game) {
+    if (true) {
       throw new GameNotFoundException(gameId);
     }

[NoCoverage] BlockStatement
src/game/game.gateway.ts:83:28
     }
     const opponent = this.userService.getOpponent(game.players, email);
     const opponentSocketId = opponent?.currentSocketId;
-    if (!opponentSocketId) {
-      return;
-    }
+    if (!opponentSocketId) {}
     game.winner = opponent;
     await game.save();

[NoCoverage] BooleanLiteral
src/game/game.gateway.ts:105:9
     const { email, gameId, move } = moveRequest;
 
     const game = await this.gameService.getGameWithPlayers(gameId);
-    if (!game) {
+    if (game) {
       throw new GameNotFoundException(gameId);
     }

[NoCoverage] ConditionalExpression
src/game/game.gateway.ts:105:9
     const { email, gameId, move } = moveRequest;
 
     const game = await this.gameService.getGameWithPlayers(gameId);
-    if (!game) {
+    if (false) {
       throw new GameNotFoundException(gameId);
     }

[NoCoverage] ConditionalExpression
src/game/game.gateway.ts:110:9
     }
 
     const opponent = this.userService.getOpponent(game.players, email);
-    if (!opponent) {
+    if (true) {
       throw new OpponentNotFoundException();
     }

[NoCoverage] ConditionalExpression
src/game/game.gateway.ts:110:9
     }
 
     const opponent = this.userService.getOpponent(game.players, email);
-    if (!opponent) {
+    if (false) {
       throw new OpponentNotFoundException();
     }

[NoCoverage] BlockStatement
src/game/game.gateway.ts:114:9
       throw new OpponentNotFoundException();
     }
 
-    try {
-      const madeMove = this.gameService.makeMove(game, move, opponent, email);
-
-      await game.updateOne(madeMove.game).exec();
-
-      if (madeMove.move.details.isGameOver) {
-        this.gameEvent.emitGameOver(client, madeMove.move.details, opponent);
-        return;
-      }
-
-      this.gameEvent.emitMoveMade(client, madeMove.move, opponent);
-    } catch (err) {
+    try {} catch (err) {
       this.gameService.undoMove(game);
       client.emit(SocketMessages.ILLEGAL_MOVE, err);

[NoCoverage] BlockStatement
src/game/game.gateway.ts:119:45
 
       await game.updateOne(madeMove.game).exec();
 
-      if (madeMove.move.details.isGameOver) {
-        this.gameEvent.emitGameOver(client, madeMove.move.details, opponent);
-        return;
-      }
+      if (madeMove.move.details.isGameOver) {}
 
       this.gameEvent.emitMoveMade(client, madeMove.move, opponent);

[NoCoverage] ConditionalExpression
src/game/game.gateway.ts:119:11
 
       await game.updateOne(madeMove.game).exec();
 
-      if (madeMove.move.details.isGameOver) {
+      if (true) {
         this.gameEvent.emitGameOver(client, madeMove.move.details, opponent);
         return;

[NoCoverage] BlockStatement
src/game/game.gateway.ts:125:19
       }
 
       this.gameEvent.emitMoveMade(client, madeMove.move, opponent);
-    } catch (err) {
-      this.gameService.undoMove(game);
-      client.emit(SocketMessages.ILLEGAL_MOVE, err);
-    }
+    } catch (err) {}
   }
 }
