[Survived] BlockStatement
src/keycloak/keycloak.service.ts:9:62
 export class KeycloakService {
   private keycloak: KeycloakConnect.Keycloak;
 
-  constructor(private readonly configService: ConfigService) {
-    const keycloakUrl = this.configService.get('KEYCLOAK_URL');
-    const keycloakRealm = this.configService.get('KEYCLOAK_REALM');
-    const keycloakClientId = this.configService.get('KEYCLOAK_CLIENT_ID');
-    if (!keycloakUrl || !keycloakRealm || !keycloakClientId) {
-      throw new Error(
-        `Keycloak configuration is not defined:  : url : ${keycloakUrl}; realm: ${keycloakRealm}; clientId: ${keycloakClientId}; `,
-      );
-    }
-
-    const keycloakConfig: KeycloakConfig = {
-      'ssl-required': 'external',
-      'confidential-port': 0,
-      realm: keycloakRealm,
-      'auth-server-url': keycloakUrl,
-      resource: keycloakClientId,
-    };
-    this.keycloak = new KeycloakConnect({}, keycloakConfig);
-  }
+  constructor(private readonly configService: ConfigService) {}
 
   async verify(token: Token): Promise<any> {

[Killed] StringLiteral
src/keycloak/keycloak.service.ts:10:48
   private keycloak: KeycloakConnect.Keycloak;
 
   constructor(private readonly configService: ConfigService) {
-    const keycloakUrl = this.configService.get('KEYCLOAK_URL');
+    const keycloakUrl = this.configService.get("");
     const keycloakRealm = this.configService.get('KEYCLOAK_REALM');
     const keycloakClientId = this.configService.get('KEYCLOAK_CLIENT_ID');
killedBy: KeycloakService should be defined
statusReason: Error: Keycloak configuration is not defined:  : url : null; realm: myrealm; clientId: myclient;

[Killed] StringLiteral
src/keycloak/keycloak.service.ts:12:53
   constructor(private readonly configService: ConfigService) {
     const keycloakUrl = this.configService.get('KEYCLOAK_URL');
     const keycloakRealm = this.configService.get('KEYCLOAK_REALM');
-    const keycloakClientId = this.configService.get('KEYCLOAK_CLIENT_ID');
+    const keycloakClientId = this.configService.get("");
     if (!keycloakUrl || !keycloakRealm || !keycloakClientId) {
       throw new Error(
killedBy: KeycloakService should be defined
statusReason: Error: Keycloak configuration is not defined:  : url : test; realm: myrealm; clientId: null;

[Killed] BooleanLiteral
src/keycloak/keycloak.service.ts:13:9
     const keycloakUrl = this.configService.get('KEYCLOAK_URL');
     const keycloakRealm = this.configService.get('KEYCLOAK_REALM');
     const keycloakClientId = this.configService.get('KEYCLOAK_CLIENT_ID');
-    if (!keycloakUrl || !keycloakRealm || !keycloakClientId) {
+    if (keycloakUrl || !keycloakRealm || !keycloakClientId) {
       throw new Error(
         `Keycloak configuration is not defined:  : url : ${keycloakUrl}; realm: ${keycloakRealm}; clientId: ${keycloakClientId}; `,
killedBy: KeycloakService should be defined
statusReason: Error: Keycloak configuration is not defined:  : url : test; realm: myrealm; clientId: myclient;

[Killed] ConditionalExpression
src/keycloak/keycloak.service.ts:13:9
     const keycloakUrl = this.configService.get('KEYCLOAK_URL');
     const keycloakRealm = this.configService.get('KEYCLOAK_REALM');
     const keycloakClientId = this.configService.get('KEYCLOAK_CLIENT_ID');
-    if (!keycloakUrl || !keycloakRealm || !keycloakClientId) {
+    if (true) {
       throw new Error(
         `Keycloak configuration is not defined:  : url : ${keycloakUrl}; realm: ${keycloakRealm}; clientId: ${keycloakClientId}; `,
killedBy: KeycloakService should be defined
statusReason: Error: Keycloak configuration is not defined:  : url : test; realm: myrealm; clientId: myclient;

[Survived] StringLiteral
src/keycloak/keycloak.service.ts:20:23
     }
 
     const keycloakConfig: KeycloakConfig = {
-      'ssl-required': 'external',
+      'ssl-required': "",
       'confidential-port': 0,
       realm: keycloakRealm,

[NoCoverage] BlockStatement
src/keycloak/keycloak.service.ts:29:44
     this.keycloak = new KeycloakConnect({}, keycloakConfig);
   }
 
-  async verify(token: Token): Promise<any> {
-    try {
-      const grant = await this.keycloak.grantManager.createGrant({
-        access_token: token,
-      });
-      const accessToken = await this.keycloak.grantManager.validateGrant(grant);
-      return accessToken.access_token;
-    } catch (error) {
-      throw new Error(`Erreur lors de la validation du token : ${error}`);
-    }
-  }
+  async verify(token: Token): Promise<any> {}
 }
 

[NoCoverage] BlockStatement
src/keycloak/keycloak.service.ts:30:9
   }
 
   async verify(token: Token): Promise<any> {
-    try {
-      const grant = await this.keycloak.grantManager.createGrant({
-        access_token: token,
-      });
-      const accessToken = await this.keycloak.grantManager.validateGrant(grant);
-      return accessToken.access_token;
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(`Erreur lors de la validation du token : ${error}`);
     }

[NoCoverage] BlockStatement
src/keycloak/keycloak.service.ts:36:21
       });
       const accessToken = await this.keycloak.grantManager.validateGrant(grant);
       return accessToken.access_token;
-    } catch (error) {
-      throw new Error(`Erreur lors de la validation du token : ${error}`);
-    }
+    } catch (error) {}
   }
 }
