[Killed] BlockStatement
src/exceptions/game.exception.ts:4:32
 import { BadRequestException, NotFoundException } from '@nestjs/common';
 
 export class GameNotFoundException extends NotFoundException {
-  constructor(gameId?: string) {
-    super(gameId ? `Game with id ${gameId} not found` : 'Game not found');
-  }
+  constructor(gameId?: string) {}
 }
 
killedBy: GameService makeMove should throw GameNotFoundException if game is not found
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: GameNotFoundException
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {

[Killed] StringLiteral
src/exceptions/game.exception.ts:5:20
 
 export class GameNotFoundException extends NotFoundException {
   constructor(gameId?: string) {
-    super(gameId ? `Game with id ${gameId} not found` : 'Game not found');
+    super(gameId ? `` : 'Game not found');
   }
 }
killedBy: Game Exceptions GameNotFoundException should create exception with game id in message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Game with id abc123 not found"
Received: "Not Found"

[Killed] BlockStatement
src/exceptions/game.exception.ts:10:17
 }
 
 export class OpponentNotFoundException extends NotFoundException {
-  constructor() {
-    super('Opponent not found');
-  }
+  constructor() {}
 }
 
killedBy: Game Exceptions OpponentNotFoundException should create exception with correct message
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/exceptions/game.exception.ts:11:11
 
 export class OpponentNotFoundException extends NotFoundException {
   constructor() {
-    super('Opponent not found');
+    super("");
   }
 }
killedBy: Game Exceptions OpponentNotFoundException should create exception with correct message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Opponent not found"
Received: "Not Found"

[Killed] BlockStatement
src/exceptions/game.exception.ts:16:17
 }
 
 export class IllegalMoveException extends BadRequestException {
-  constructor() {
-    super('Illegal move');
-  }
+  constructor() {}
 }
 
killedBy: GameService makeMove should throw IllegalMoveException for illegal move
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: IllegalMoveException
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      73 |     } else {
