[Killed] BlockStatement
src/game/game.service.ts:28:68
     private readonly userService: UserService,
   ) {}
 
-  async createGame(email: string, socketId: string): Promise<Game> {
-    const user = await this.userService.findAndUpdatePlayerSocket(
-      email,
-      socketId,
-    );
-
-    const gameId = nanoid(6);
-    const game = await this.gameModel.create({
-      id: gameId,
-      players: [user],
-      status: 'pending',
-      fen: this.engine.newGame(gameId),
-      currentPlayer: user,
-    });
-
-    return game;
-  }
+  async createGame(email: string, socketId: string): Promise<Game> {}
 
   async getGame(gameId: string): Promise<GameDocument | null> {
killedBy: GameService createGame should create a new game successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] StringLiteral
src/game/game.service.ts:38:15
     const game = await this.gameModel.create({
       id: gameId,
       players: [user],
-      status: 'pending',
+      status: "",
       fen: this.engine.newGame(gameId),
       currentPlayer: user,
killedBy: GameService createGame should create a new game successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,16 +4,16 @@
      "elo": 3000,
      "email": "player@test.com",

[Killed] BlockStatement
src/game/game.service.ts:46:63
     return game;
   }
 
-  async getGame(gameId: string): Promise<GameDocument | null> {
-    return this.gameModel.findOne({ id: gameId }).exec();
-  }
+  async getGame(gameId: string): Promise<GameDocument | null> {}
 
   async joinGame(
killedBy: GameService getGame should return game when found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": "game123"}

Number of calls: 0

[Killed] ObjectLiteral
src/game/game.service.ts:47:35
   }
 
   async getGame(gameId: string): Promise<GameDocument | null> {
-    return this.gameModel.findOne({ id: gameId }).exec();
+    return this.gameModel.findOne({}).exec();
   }
 
killedBy: GameService getGame should return game when found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "id": "game123",
- }

[Killed] BlockStatement
src/game/game.service.ts:54:35
     gameId: string,
     email: string,
     socketId: string,
-  ): Promise<GameDocument | null> {
-    const [user, game] = await Promise.all([
-      this.userService.findAndUpdatePlayerSocket(email, socketId),
-      this.getGameWithPlayers(gameId),
-    ]);
-    if (!game || !this.canJoinGame(game)) {
-      throw new NotFoundException(
-        `Game with id ${gameId} not found or already full : ${!game?.players.length ? 'no' : game?.players.length} player(s) inside`,
-      );
-    }
-
-    game.players.push(user);
-    game.status = 'playing';
-    await game.save();
-    return game;
-  }
+  ): Promise<GameDocument | null> {}
 
   makeMove(
killedBy: GameService joinGame should successfully join a game
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
src/game/game.service.ts:59:9
       this.userService.findAndUpdatePlayerSocket(email, socketId),
       this.getGameWithPlayers(gameId),
     ]);
-    if (!game || !this.canJoinGame(game)) {
+    if (true) {
       throw new NotFoundException(
         `Game with id ${gameId} not found or already full : ${!game?.players.length ? 'no' : game?.players.length} player(s) inside`,
killedBy: GameService joinGame should successfully join a game
statusReason: NotFoundException: Game with id game123 not found or already full : 1 player(s) inside

[Killed] BooleanLiteral
src/game/game.service.ts:59:9
       this.userService.findAndUpdatePlayerSocket(email, socketId),
       this.getGameWithPlayers(gameId),
     ]);
-    if (!game || !this.canJoinGame(game)) {
+    if (game || !this.canJoinGame(game)) {
       throw new NotFoundException(
         `Game with id ${gameId} not found or already full : ${!game?.players.length ? 'no' : game?.players.length} player(s) inside`,
killedBy: GameService joinGame should successfully join a game
statusReason: NotFoundException: Game with id game123 not found or already full : 1 player(s) inside

[Killed] BooleanLiteral
src/game/game.service.ts:61:63
     ]);
     if (!game || !this.canJoinGame(game)) {
       throw new NotFoundException(
-        `Game with id ${gameId} not found or already full : ${!game?.players.length ? 'no' : game?.players.length} player(s) inside`,
+        `Game with id ${gameId} not found or already full : ${game?.players.length ? 'no' : game?.players.length} player(s) inside`,
       );
     }
killedBy: GameService joinGame should throw NotFoundException when game is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Game with id game123 not found or already full : no player(s) inside"
Received message: "Game with id game123 not found or already full : undefined player(s) inside"

       98 |         } else {
       99 |           stryCov_9fa48("94");

[Killed] OptionalChaining
src/game/game.service.ts:61:64
     ]);
     if (!game || !this.canJoinGame(game)) {
       throw new NotFoundException(
-        `Game with id ${gameId} not found or already full : ${!game?.players.length ? 'no' : game?.players.length} player(s) inside`,
+        `Game with id ${gameId} not found or already full : ${!game.players.length ? 'no' : game?.players.length} player(s) inside`,
       );
     }
killedBy: GameService joinGame should throw NotFoundException when game is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Game with id game123 not found or already full : no player(s) inside"
Received message: "Cannot read properties of null (reading 'players')"

       98 |         } else {
       99 |           stryCov_9fa48("94");

[Killed] StringLiteral
src/game/game.service.ts:66:19
     }
 
     game.players.push(user);
-    game.status = 'playing';
+    game.status = "";
     await game.save();
     return game;
killedBy: GameService joinGame should successfully join a game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "playing"
Received: ""

[Killed] BlockStatement
src/game/game.service.ts:76:47
     move: IMoveRequest,
     opponent: User,
     email: string,
-  ): { move: IValidMove; game: GameDocument } {
-    const gameToUpdate = game;
-    if (!gameToUpdate) {
-      throw new GameNotFoundException();
-    }
-
-    const madeMove = this.engine.makeMove(gameToUpdate.id, move);
-
-    if (!this.isLegalMove(madeMove)) {
-      throw new IllegalMoveException();
-    }
-
-    const isGameOver = madeMove.details.isGameOver;
-
-    return {
-      move: madeMove,
-      game: isGameOver
-        ? this.buildEndPayload(game, madeMove.details, email)
-        : this.buildUpdatePayload(game, madeMove, opponent),
-    };
-  }
+  ): { move: IValidMove; game: GameDocument } {}
 
   buildUpdatePayload(
killedBy: GameService makeMove should process a valid move successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "winner@gmail.com", {"from": "e2", "to": "e4"}

Number of calls: 0

[Killed] ConditionalExpression
src/game/game.service.ts:78:9
     email: string,
   ): { move: IValidMove; game: GameDocument } {
     const gameToUpdate = game;
-    if (!gameToUpdate) {
+    if (false) {
       throw new GameNotFoundException();
     }
killedBy: GameService makeMove should throw GameNotFoundException if game is not found
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: GameNotFoundException
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'id')"

      124 |         }

[Killed] BooleanLiteral
src/game/game.service.ts:78:9
     email: string,
   ): { move: IValidMove; game: GameDocument } {
     const gameToUpdate = game;
-    if (!gameToUpdate) {
+    if (gameToUpdate) {
       throw new GameNotFoundException();
     }
killedBy: GameService makeMove should process a valid move successfully
statusReason: GameNotFoundException: Game not found

[Killed] BlockStatement
src/game/game.service.ts:84:38
 
     const madeMove = this.engine.makeMove(gameToUpdate.id, move);
 
-    if (!this.isLegalMove(madeMove)) {
-      throw new IllegalMoveException();
-    }
+    if (!this.isLegalMove(madeMove)) {}
 
     const isGameOver = madeMove.details.isGameOver;
killedBy: GameService makeMove should throw IllegalMoveException for illegal move
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: IllegalMoveException
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'isGameOver')"

      133 |         }

[Killed] BooleanLiteral
src/game/game.service.ts:84:9
 
     const madeMove = this.engine.makeMove(gameToUpdate.id, move);
 
-    if (!this.isLegalMove(madeMove)) {
+    if (this.isLegalMove(madeMove)) {
       throw new IllegalMoveException();
     }
killedBy: GameService makeMove should process a valid move successfully
statusReason: IllegalMoveException: Illegal move

[Killed] ObjectLiteral
src/game/game.service.ts:90:12
 
     const isGameOver = madeMove.details.isGameOver;
 
-    return {
-      move: madeMove,
-      game: isGameOver
-        ? this.buildEndPayload(game, madeMove.details, email)
-        : this.buildUpdatePayload(game, madeMove, opponent),
-    };
+    return {};
   }
 
killedBy: GameService makeMove should process a valid move successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"details": {"fen": "new-position", "isGameOver": false, "status": "playing"}, "valid": true}
Received: undefined

[Killed] BlockStatement
src/game/game.service.ts:102:19
     game: GameDocument,
     move: IValidMove,
     opponent: User,
-  ): GameDocument {
-    const gameToUpdate = game;
-    const { details } = move;
-    gameToUpdate.fen = details.fen;
-    gameToUpdate.status = details.status;
-    gameToUpdate.currentPlayer = opponent;
-    return gameToUpdate;
-  }
+  ): GameDocument {}
 
   buildEndPayload(
killedBy: GameService buildUpdatePayload should update game state with move details and new current player
statusReason: TypeError: Cannot read properties of undefined (reading 'fen')

[Killed] BlockStatement
src/game/game.service.ts:115:19
     game: GameDocument,
     moveDetails: IEndGameDetails,
     winnerEmail: string,
-  ): GameDocument {
-    const gameToUpdate = game;
-    const winner = game.players.find((player) => player.email === winnerEmail);
-    const { fen, status } = moveDetails;
-    gameToUpdate.fen = fen;
-    gameToUpdate.status = status;
-    if (winner && (status === 'checkmate' || status === 'resign')) {
-      gameToUpdate.winner = winner;
-    }
-    return gameToUpdate;
-  }
+  ): GameDocument {}
 
   async getGameWithPlayers(gameId: string): Promise<GameDocument | null> {
killedBy: GameService buildEndPayload should set winner when status is checkmate and winner exists
statusReason: TypeError: Cannot read properties of undefined (reading 'fen')

[Killed] ConditionalExpression
src/game/game.service.ts:117:50
     winnerEmail: string,
   ): GameDocument {
     const gameToUpdate = game;
-    const winner = game.players.find((player) => player.email === winnerEmail);
+    const winner = game.players.find((player) => true);
     const { fen, status } = moveDetails;
     gameToUpdate.fen = fen;
killedBy: GameService buildEndPayload should update game state without setting winner when email does not match
statusReason: Error: expect(received).toBeUndefined()

Received: {"currentSocketId": "player1", "elo": 3000, "email": "winner@gmail.com", "gamertag": "player1"}

[Killed] ArrowFunction
src/game/game.service.ts:117:38
     winnerEmail: string,
   ): GameDocument {
     const gameToUpdate = game;
-    const winner = game.players.find((player) => player.email === winnerEmail);
+    const winner = game.players.find(() => undefined);
     const { fen, status } = moveDetails;
     gameToUpdate.fen = fen;
killedBy: GameService buildEndPayload should set winner when status is checkmate and winner exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "test", "elo": 3000, "email": "winner@gmail.com", "gamertag": "test"}
Received: undefined

[Killed] ConditionalExpression
src/game/game.service.ts:121:9
     const { fen, status } = moveDetails;
     gameToUpdate.fen = fen;
     gameToUpdate.status = status;
-    if (winner && (status === 'checkmate' || status === 'resign')) {
+    if (true) {
       gameToUpdate.winner = winner;
     }
killedBy: GameService buildEndPayload should not set winner when status is draw even if winner email provided
statusReason: Error: expect(received).toBeUndefined()

Received: {"currentSocketId": "test", "elo": 3000, "email": "winner@gmail.com", "gamertag": "test"}

[Killed] ConditionalExpression
src/game/game.service.ts:121:20
     const { fen, status } = moveDetails;
     gameToUpdate.fen = fen;
     gameToUpdate.status = status;
-    if (winner && (status === 'checkmate' || status === 'resign')) {
+    if (winner && (true)) {
       gameToUpdate.winner = winner;
     }
killedBy: GameService buildEndPayload should not set winner when status is draw even if winner email provided
statusReason: Error: expect(received).toBeUndefined()

Received: {"currentSocketId": "test", "elo": 3000, "email": "winner@gmail.com", "gamertag": "test"}

[Killed] BlockStatement
src/game/game.service.ts:127:74
     return gameToUpdate;
   }
 
-  async getGameWithPlayers(gameId: string): Promise<GameDocument | null> {
-    return this.gameModel.findOne({ id: gameId }).populate('players').exec();
-  }
+  async getGameWithPlayers(gameId: string): Promise<GameDocument | null> {}
 
   undoMove(game: Game): void {
killedBy: GameService should findAndUpdatePlayerSocket ?
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": "game1"}

Number of calls: 0

[Killed] ObjectLiteral
src/game/game.service.ts:128:35
   }
 
   async getGameWithPlayers(gameId: string): Promise<GameDocument | null> {
-    return this.gameModel.findOne({ id: gameId }).populate('players').exec();
+    return this.gameModel.findOne({}).populate('players').exec();
   }
 
killedBy: GameService should findAndUpdatePlayerSocket ?
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "id": "game1",
- }

[Killed] BlockStatement
src/game/game.service.ts:131:30
     return this.gameModel.findOne({ id: gameId }).populate('players').exec();
   }
 
-  undoMove(game: Game): void {
-    this.engine.undoMove(game.id);
-  }
+  undoMove(game: Game): void {}
 
   isLegalMove(move: IMove): move is IValidMove {
killedBy: GameService undoMove should call engine undoMove
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "game123"

Number of calls: 0

[Killed] BlockStatement
src/game/game.service.ts:135:48
     this.engine.undoMove(game.id);
   }
 
-  isLegalMove(move: IMove): move is IValidMove {
-    return !!move.valid && !!move.details;
-  }
+  isLegalMove(move: IMove): move is IValidMove {}
 
   private canJoinGame(game: GameDocument): boolean {
killedBy: GameService isLegalMove should be true if move is valid and contains details
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BooleanLiteral
src/game/game.service.ts:136:28
   }
 
   isLegalMove(move: IMove): move is IValidMove {
-    return !!move.valid && !!move.details;
+    return !!move.valid && !move.details;
   }
 
killedBy: GameService isLegalMove should be true if move is valid and contains details
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/game/game.service.ts:139:52
     return !!move.valid && !!move.details;
   }
 
-  private canJoinGame(game: GameDocument): boolean {
-    return game.players.length < 2 && game.status === 'pending';
-  }
+  private canJoinGame(game: GameDocument): boolean {}
 }
 
killedBy: GameService joinGame should successfully join a game
statusReason: NotFoundException: Game with id game123 not found or already full : 1 player(s) inside

[Killed] LogicalOperator
src/game/game.service.ts:140:12
   }
 
   private canJoinGame(game: GameDocument): boolean {
-    return game.players.length < 2 && game.status === 'pending';
+    return game.players.length < 2 || game.status === 'pending';
   }
 }
killedBy: GameService joinGame should throw NotFoundException when game is full
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] ConditionalExpression
src/game/game.service.ts:140:12
   }
 
   private canJoinGame(game: GameDocument): boolean {
-    return game.players.length < 2 && game.status === 'pending';
+    return false;
   }
 }
killedBy: GameService joinGame should successfully join a game
statusReason: NotFoundException: Game with id game123 not found or already full : 1 player(s) inside
