[Killed] BlockStatement
src/game.event/game.event.service.ts:12:47
 export class GameEventService {
   constructor() {}
 
-  emitGameCreated(client: Socket, game: Game) {
-    client.join(game.id);
-    client.emit(SocketMessages.GAME_CREATED, game);
-  }
+  emitGameCreated(client: Socket, game: Game) {}
 
   emitGameJoined(
killedBy: GameEventService emitGameCreated should join room and emit game created event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "game123"

Number of calls: 0

[Killed] BlockStatement
src/game.event/game.event.service.ts:22:5
     game: Game,
     opponentSocketId: string,
     gameId: string,
-  ) {
-    client.join(gameId);
-    client.emit(SocketMessages.PLAYER_JOINED, {
-      gameId,
-      status: 'playing',
-    });
-    client
-      .to(opponentSocketId)
-      .emit(SocketMessages.GAME_STARTED, { ...game, status: 'playing' });
-  }
+  ) {}
 
   emitError(client: Socket, msg: string) {
killedBy: GameEventService emitGameJoined should join room and emit appropriate events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "socket123"

Number of calls: 0

[Killed] StringLiteral
src/game.event/game.event.service.ts:26:15
     client.join(gameId);
     client.emit(SocketMessages.PLAYER_JOINED, {
       gameId,
-      status: 'playing',
+      status: "",
     });
     client
killedBy: GameEventService emitGameJoined should join room and emit appropriate events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "playerJoined", {"gameId": "game123", "status": "playing"}
Received
       1
          "playerJoined",
          Object {
            "gameId": "game123",

[Survived] ObjectLiteral
src/game.event/game.event.service.ts:30:42
     });
     client
       .to(opponentSocketId)
-      .emit(SocketMessages.GAME_STARTED, { ...game, status: 'playing' });
+      .emit(SocketMessages.GAME_STARTED, {});
   }
 

[Killed] BlockStatement
src/game.event/game.event.service.ts:33:42
       .emit(SocketMessages.GAME_STARTED, { ...game, status: 'playing' });
   }
 
-  emitError(client: Socket, msg: string) {
-    client.emit(SocketMessages.ERROR, msg);
-  }
+  emitError(client: Socket, msg: string) {}
 
   emitMoveMade(client: Socket, move: IMove, opponent: User) {
killedBy: GameEventService emitError should emit error message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "error", "Test error"

Number of calls: 0

[Killed] BlockStatement
src/game.event/game.event.service.ts:37:61
     client.emit(SocketMessages.ERROR, msg);
   }
 
-  emitMoveMade(client: Socket, move: IMove, opponent: User) {
-    client.to(opponent.currentSocketId).emit(SocketMessages.MOVE_MADE, {
-      ...move.details,
-      currentPlayer: opponent.currentSocketId,
-    });
-
-    client.emit(SocketMessages.MOVE_MADE, {
-      ...move.details,
-      currentPlayer: opponent.currentSocketId,
-    });
-  }
+  emitMoveMade(client: Socket, move: IMove, opponent: User) {}
 
   emitGameOver(client: Socket, details: IValidMove['details'], opponent: User) {
killedBy: GameEventService emitMoveMade should emit move to both players
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test"

Number of calls: 0

[Survived] ObjectLiteral
src/game.event/game.event.service.ts:43:43
       currentPlayer: opponent.currentSocketId,
     });
 
-    client.emit(SocketMessages.MOVE_MADE, {
-      ...move.details,
-      currentPlayer: opponent.currentSocketId,
-    });
+    client.emit(SocketMessages.MOVE_MADE, {});
   }
 

[Killed] BlockStatement
src/game.event/game.event.service.ts:49:80
     });
   }
 
-  emitGameOver(client: Socket, details: IValidMove['details'], opponent: User) {
-    client.to(opponent.currentSocketId).emit(SocketMessages.GAME_OVER, {
-      ...details,
-      currentPlayer: opponent.currentSocketId,
-    });
-
-    client.emit(SocketMessages.GAME_OVER, {
-      ...details,
-      currentPlayer: opponent.currentSocketId,
-    });
-  }
+  emitGameOver(client: Socket, details: IValidMove['details'], opponent: User) {}
 
   emitLeave(client: Socket, winner: User) {
killedBy: GameEventService emitGameOver should emit game over to both players
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test"

Number of calls: 0

[Killed] BlockStatement
src/game.event/game.event.service.ts:61:43
     });
   }
 
-  emitLeave(client: Socket, winner: User) {
-    client.to(winner.currentSocketId).emit(SocketMessages.GAME_OVER, {
-      winner,
-      status: 'resign',
-    });
-  }
+  emitLeave(client: Socket, winner: User) {}
 }
 
killedBy: GameEventService emitLeave should emit game over with resign status to winner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "winner123"

Number of calls: 0

[Killed] ObjectLiteral
src/game.event/game.event.service.ts:62:70
   }
 
   emitLeave(client: Socket, winner: User) {
-    client.to(winner.currentSocketId).emit(SocketMessages.GAME_OVER, {
-      winner,
-      status: 'resign',
-    });
+    client.to(winner.currentSocketId).emit(SocketMessages.GAME_OVER, {});
   }
 }
killedBy: GameEventService emitLeave should emit game over with resign status to winner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "gameOver", ObjectContaining {"status": "resign", "winner": {"currentSocketId": "winner123"}}
Received: "gameOver", {}

Number of calls: 1

[Killed] StringLiteral
src/game.event/game.event.service.ts:64:15
   emitLeave(client: Socket, winner: User) {
     client.to(winner.currentSocketId).emit(SocketMessages.GAME_OVER, {
       winner,
-      status: 'resign',
+      status: "",
     });
   }
killedBy: GameEventService emitLeave should emit game over with resign status to winner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "gameOver", ObjectContaining {"status": "resign", "winner": {"currentSocketId": "winner123"}}
Received: "gameOver", {"status": "", "winner": {"currentSocketId": "winner123"}}

Number of calls: 1
