[Survived] BlockStatement
src/user/user.service.ts:9:79
 @Injectable()
 export class UserService {
   logger: Logger;
-  constructor(@InjectModel(User.name) private userModel: Model<UserDocument>) {
-    this.logger = new Logger(UserService.name);
-  }
+  constructor(@InjectModel(User.name) private userModel: Model<UserDocument>) {}
 
   async findAndUpdatePlayerSocket(

[Killed] BlockStatement
src/user/user.service.ts:16:20
   async findAndUpdatePlayerSocket(
     email: string,
     socketId: string,
-  ): Promise<User> {
-    const user = await this.userModel.findOne({ email }).exec();
-    if (!user) {
-      throw new NotFoundException(`User with email ${email} not found`);
-    }
-    user.currentSocketId = socketId;
-    await user.save();
-    return user;
-  }
+  ): Promise<User> {}
 
   getOpponent(players: User[], email: string): User | null {
killedBy: UserService should findAndUpdatePlayerSocket ?
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined

[Killed] ConditionalExpression
src/user/user.service.ts:18:9
     socketId: string,
   ): Promise<User> {
     const user = await this.userModel.findOne({ email }).exec();
-    if (!user) {
+    if (true) {
       throw new NotFoundException(`User with email ${email} not found`);
     }
killedBy: UserService should findAndUpdatePlayerSocket ?
statusReason: NotFoundException: User with email winner@gmail.com not found

[Killed] BooleanLiteral
src/user/user.service.ts:18:9
     socketId: string,
   ): Promise<User> {
     const user = await this.userModel.findOne({ email }).exec();
-    if (!user) {
+    if (user) {
       throw new NotFoundException(`User with email ${email} not found`);
     }
killedBy: UserService should findAndUpdatePlayerSocket ?
statusReason: NotFoundException: User with email winner@gmail.com not found

[Killed] BlockStatement
src/user/user.service.ts:26:60
     return user;
   }
 
-  getOpponent(players: User[], email: string): User | null {
-    if (players.map((player) => player.email).includes(email)) {
-      return players.find((player) => player.email !== email) ?? null;
-    }
-    return null;
-  }
+  getOpponent(players: User[], email: string): User | null {}
 }
 
killedBy: UserService should return a players opponent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "Vitani", "elo": 2, "email": "loser@gmail.com", "gamertag": "test"}
Received: undefined

[Killed] BlockStatement
src/user/user.service.ts:27:64
   }
 
   getOpponent(players: User[], email: string): User | null {
-    if (players.map((player) => player.email).includes(email)) {
-      return players.find((player) => player.email !== email) ?? null;
-    }
+    if (players.map((player) => player.email).includes(email)) {}
     return null;
   }
killedBy: UserService should return a players opponent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "Vitani", "elo": 2, "email": "loser@gmail.com", "gamertag": "test"}
Received: null

[Killed] ConditionalExpression
src/user/user.service.ts:27:9
   }
 
   getOpponent(players: User[], email: string): User | null {
-    if (players.map((player) => player.email).includes(email)) {
+    if (true) {
       return players.find((player) => player.email !== email) ?? null;
     }
killedBy: UserService should return null if the email is none of the players
statusReason: Error: expect(received).toBeNull()

Received: {"currentSocketId": "test", "elo": 3000, "email": "winner@gmail.com", "gamertag": "test"}

[Killed] ConditionalExpression
src/user/user.service.ts:28:39
 
   getOpponent(players: User[], email: string): User | null {
     if (players.map((player) => player.email).includes(email)) {
-      return players.find((player) => player.email !== email) ?? null;
+      return players.find((player) => false) ?? null;
     }
     return null;
killedBy: UserService should return a players opponent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "Vitani", "elo": 2, "email": "loser@gmail.com", "gamertag": "test"}
Received: null

[Killed] ConditionalExpression
src/user/user.service.ts:28:39
 
   getOpponent(players: User[], email: string): User | null {
     if (players.map((player) => player.email).includes(email)) {
-      return players.find((player) => player.email !== email) ?? null;
+      return players.find((player) => true) ?? null;
     }
     return null;
killedBy: UserService should return a players opponent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  Object {
-   "currentSocketId": "Vitani",
-   "elo": 2,
