[Killed] BlockStatement
src/engine/service/engine.service.ts:14:35
    * Creates a new game and returns the initial FEN string.
    * @param gameId The ID of the game.
    */
-  newGame(gameId: string): string {
-    const chess = new Chess();
-    this.boards.set(gameId, chess);
-    return chess.fen();
-  }
+  newGame(gameId: string): string {}
 
   /**
killedBy: EngineService newGame should create a new chess game and return initial FEN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "initial fen"
Received: undefined

[Survived] BlockStatement
src/engine/service/engine.service.ts:56:28
    * Undoes the last move in the game.
    * @param gameId The ID of the game.
    */
-  undoMove(gameId: string) {
-    const chess = this.boards.get(gameId);
-    if (chess) {
-      chess.undo();
-    }
-  }
+  undoMove(gameId: string) {}
 
   /**

[Survived] ConditionalExpression
src/engine/service/engine.service.ts:58:9
    */
   undoMove(gameId: string) {
     const chess = this.boards.get(gameId);
-    if (chess) {
+    if (false) {
       chess.undo();
     }

[Killed] BlockStatement
src/engine/service/engine.service.ts:67:51
    * Gets the current status of the game.
    * @param chess
    */
-  private getGameStatus(chess: Chess): GameStatus {
-    if (chess.isCheckmate()) return 'checkmate';
-    if (chess.isStalemate()) return 'stalemate';
-    if (chess.isDraw()) return 'draw';
-    return 'playing';
-  }
+  private getGameStatus(chess: Chess): GameStatus {}
 
   /**
killedBy: EngineService makeMove should successfully make a valid move
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "playing"
Received: undefined

[Killed] BlockStatement
src/engine/service/engine.service.ts:78:51
    * Checks if the game is over.
    * @param status
    */
-  private isGameOver(status: GameStatus): boolean {
-    return ['stalemate', 'draw', 'checkmate'].includes(status);
-  }
+  private isGameOver(status: GameStatus): boolean {}
 }
 
killedBy: EngineService isGameOver should correctly identify game over states
statusReason: Error: expect(received).toBeTruthy()

Received: undefined
