[NoCoverage] BlockStatement
src/game/gateway/game.gateway.ts:36:36
    * Handles the connection of a client.
    * @param client The socket client.
    */
-  handleConnection(client: Socket) {
-    this.logger.log(`Client connected: ${client.id}`);
-  }
+  handleConnection(client: Socket) {}
 
   /**

[NoCoverage] BlockStatement
src/game/gateway/game.gateway.ts:44:36
    * Handles the disconnection of a client.
    * @param client The socket client.
    */
-  handleDisconnect(client: Socket) {
-    this.logger.log(`Client déconnecté: ${client.id}`);
-  }
+  handleDisconnect(client: Socket) {}
 
   /**

[NoCoverage] BlockStatement
src/game/gateway/game.gateway.ts:59:5
   async handleCreate(
     @ConnectedSocket() client: Socket,
     @MessageBody() email: string,
-  ) {
-    this.logger.log(
-      `Handle create from ${client.id}: ${JSON.stringify(email)}`,
-    );
-    const game = await this.gameService.createGame(email, client.id);
-    await this.gameEvent.emitGameCreated(client, game);
-  }
+  ) {}
 
   /**

[NoCoverage] BlockStatement
src/game/gateway/game.gateway.ts:77:5
   async handleJoin(
     @MessageBody() joinRequest: { gameId: string; email: string },
     @ConnectedSocket() client: Socket,
-  ) {
-    this.logger.log(
-      `Handle join from ${client.id}: ${JSON.stringify(joinRequest.gameId)}`,
-    );
-    const { gameId, email } = joinRequest;
-
-    const game = await this.gameService.joinGame(gameId, email, client.id);
-    if (!game) {
-      throw new GameNotFoundException(gameId);
-    }
-    const opponent = this.userService.getOpponent(game.players, email);
-    const opponentSocketId = opponent?.currentSocketId;
-    if (!opponentSocketId) {
-      throw new OpponentNotFoundException();
-    }
-    await this.gameEvent.emitGameJoined(client, game, opponentSocketId, gameId);
-  }
+  ) {}
 
   /**

[NoCoverage] ConditionalExpression
src/game/gateway/game.gateway.ts:84:9
     const { gameId, email } = joinRequest;
 
     const game = await this.gameService.joinGame(gameId, email, client.id);
-    if (!game) {
+    if (false) {
       throw new GameNotFoundException(gameId);
     }

[NoCoverage] BlockStatement
src/game/gateway/game.gateway.ts:89:28
     }
     const opponent = this.userService.getOpponent(game.players, email);
     const opponentSocketId = opponent?.currentSocketId;
-    if (!opponentSocketId) {
-      throw new OpponentNotFoundException();
-    }
+    if (!opponentSocketId) {}
     await this.gameEvent.emitGameJoined(client, game, opponentSocketId, gameId);
   }

[NoCoverage] BooleanLiteral
src/game/gateway/game.gateway.ts:89:9
     }
     const opponent = this.userService.getOpponent(game.players, email);
     const opponentSocketId = opponent?.currentSocketId;
-    if (!opponentSocketId) {
+    if (opponentSocketId) {
       throw new OpponentNotFoundException();
     }

[NoCoverage] BlockStatement
src/game/gateway/game.gateway.ts:105:5
   async handleLeave(
     @MessageBody() leaveRequest: { gameId: string; email: string },
     @ConnectedSocket() client: Socket,
-  ) {
-    const { gameId, email } = leaveRequest;
-    const game = await this.gameService.getGameWithPlayers(gameId);
-
-    if (!game) {
-      throw new GameNotFoundException(gameId);
-    }
-    const opponent = this.userService.getOpponent(game.players, email);
-    const opponentSocketId = opponent?.currentSocketId;
-    if (!opponentSocketId) {
-      return;
-    }
-    game.winner = opponent;
-    await game.save();
-    await this.gameEvent.emitLeave(client, opponent, gameId);
-  }
+  ) {}
 
   /**

[NoCoverage] BooleanLiteral
src/game/gateway/game.gateway.ts:109:9
     const { gameId, email } = leaveRequest;
     const game = await this.gameService.getGameWithPlayers(gameId);
 
-    if (!game) {
+    if (game) {
       throw new GameNotFoundException(gameId);
     }

[NoCoverage] BlockStatement
src/game/gateway/game.gateway.ts:141:16
     const { email, gameId, move } = moveRequest;
 
     const game = await this.gameService.getGameWithPlayers(gameId);
-    if (!game) {
-      throw new GameNotFoundException(gameId);
-    }
+    if (!game) {}
 
     const opponent = this.userService.getOpponent(game.players, email);

[NoCoverage] BlockStatement
src/game/gateway/game.gateway.ts:150:9
       throw new OpponentNotFoundException();
     }
 
-    try {
-      const madeMove = this.gameService.makeMove(game, move, opponent, email);
-
-      await game.updateOne(madeMove.game).exec();
-
-      if (madeMove.move.details.isGameOver) {
-        await this.gameEvent.emitGameOver(
-          client,
-          { ...madeMove.move.details, winner: madeMove.game.winner },
-          opponent,
-          gameId,
-        );
-        return;
-      }
-
-      this.gameEvent.emitMoveMade(client, madeMove.move, opponent);
-    } catch (err) {
+    try {} catch (err) {
       this.gameService.undoMove(game);
       client.emit(SocketMessages.ILLEGAL_MOVE, err);

[NoCoverage] ConditionalExpression
src/game/gateway/game.gateway.ts:155:11
 
       await game.updateOne(madeMove.game).exec();
 
-      if (madeMove.move.details.isGameOver) {
+      if (false) {
         await this.gameEvent.emitGameOver(
           client,

[NoCoverage] ObjectLiteral
src/game/gateway/game.gateway.ts:158:11
       if (madeMove.move.details.isGameOver) {
         await this.gameEvent.emitGameOver(
           client,
-          { ...madeMove.move.details, winner: madeMove.game.winner },
+          {},
           opponent,
           gameId,
