[Killed] StringLiteral
src/keycloak/service/keycloak.service.ts:11:50
 
   constructor(private readonly configService: ConfigService) {
     const keycloakUrl = this.configService.get('KEYCLOAK_URL');
-    const keycloakRealm = this.configService.get('KEYCLOAK_REALM');
+    const keycloakRealm = this.configService.get("");
     const keycloakClientId = this.configService.get('KEYCLOAK_CLIENT_ID');
     if (!keycloakUrl || !keycloakRealm || !keycloakClientId) {
killedBy: KeycloakService should be defined
statusReason: Error: Keycloak configuration is not defined:  : url : test; realm: null; clientId: myclient;

[Killed] BooleanLiteral
src/keycloak/service/keycloak.service.ts:13:43
     const keycloakUrl = this.configService.get('KEYCLOAK_URL');
     const keycloakRealm = this.configService.get('KEYCLOAK_REALM');
     const keycloakClientId = this.configService.get('KEYCLOAK_CLIENT_ID');
-    if (!keycloakUrl || !keycloakRealm || !keycloakClientId) {
+    if (!keycloakUrl || !keycloakRealm || keycloakClientId) {
       throw new Error(
         `Keycloak configuration is not defined:  : url : ${keycloakUrl}; realm: ${keycloakRealm}; clientId: ${keycloakClientId}; `,
killedBy: KeycloakService should be defined
statusReason: Error: Keycloak configuration is not defined:  : url : test; realm: myrealm; clientId: myclient;

[NoCoverage] StringLiteral
src/keycloak/service/keycloak.service.ts:15:9
     const keycloakClientId = this.configService.get('KEYCLOAK_CLIENT_ID');
     if (!keycloakUrl || !keycloakRealm || !keycloakClientId) {
       throw new Error(
-        `Keycloak configuration is not defined:  : url : ${keycloakUrl}; realm: ${keycloakRealm}; clientId: ${keycloakClientId}; `,
+        ``,
       );
     }

[NoCoverage] BlockStatement
src/keycloak/service/keycloak.service.ts:33:44
    * Verifies the token with Keycloak.
    * @param token The token to verify.
    */
-  async verify(token: Token): Promise<any> {
-    try {
-      const grant = await this.keycloak.grantManager.createGrant({
-        access_token: token,
-      });
-      const accessToken = await this.keycloak.grantManager.validateGrant(grant);
-      return accessToken.access_token;
-    } catch (error) {
-      throw new Error(`Erreur lors de la validation du token : ${error}`);
-    }
-  }
+  async verify(token: Token): Promise<any> {}
 }
 

[NoCoverage] ObjectLiteral
src/keycloak/service/keycloak.service.ts:35:66
    */
   async verify(token: Token): Promise<any> {
     try {
-      const grant = await this.keycloak.grantManager.createGrant({
-        access_token: token,
-      });
+      const grant = await this.keycloak.grantManager.createGrant({});
       const accessToken = await this.keycloak.grantManager.validateGrant(grant);
       return accessToken.access_token;
