[Killed] StringLiteral
src/game/exception/game.exception.ts:5:57
 
 export class GameNotFoundException extends NotFoundException {
   constructor(gameId?: string) {
-    super(gameId ? `Game with id ${gameId} not found` : 'Game not found');
+    super(gameId ? `Game with id ${gameId} not found` : "");
   }
 }
killedBy: Game Exceptions GameNotFoundException should create exception with default message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Game not found"
Received: "Not Found"
