[Killed] BlockStatement
src/game/service/game.service.ts:33:68
    * @param email The email of the host.
    * @param socketId The socket ID of the host.
    */
-  async createGame(email: string, socketId: string): Promise<Game> {
-    const user = await this.userService.findAndUpdatePlayerSocket(
-      email,
-      socketId,
-    );
-
-    const gameId = nanoid(6);
-    const game = await this.gameModel.create({
-      id: gameId,
-      players: [user],
-      status: 'pending',
-      fen: this.engine.newGame(gameId),
-      currentPlayer: user,
-    });
-
-    return game;
-  }
+  async createGame(email: string, socketId: string): Promise<Game> {}
 
   /**
killedBy: GameService createGame should create a new game successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ObjectLiteral
src/game/service/game.service.ts:40:46
     );
 
     const gameId = nanoid(6);
-    const game = await this.gameModel.create({
-      id: gameId,
-      players: [user],
-      status: 'pending',
-      fen: this.engine.newGame(gameId),
-      currentPlayer: user,
-    });
+    const game = await this.gameModel.create({});
 
     return game;
killedBy: GameService createGame should create a new game successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "currentPlayer": Object {
-     "currentSocketId": "socket123",

[Killed] BlockStatement
src/game/service/game.service.ts:55:63
    * Retrieves a game by its ID.
    * @param gameId The ID of the game.
    */
-  async getGame(gameId: string): Promise<GameDocument | null> {
-    return this.gameModel.findOne({ id: gameId }).exec();
-  }
+  async getGame(gameId: string): Promise<GameDocument | null> {}
 
   /**
killedBy: GameService getGame should return game when found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": "game123"}

Number of calls: 0

[Killed] ArrayDeclaration
src/game/service/game.service.ts:70:44
     email: string,
     socketId: string,
   ): Promise<GameDocument | null> {
-    const [user, game] = await Promise.all([
-      this.userService.findAndUpdatePlayerSocket(email, socketId),
-      this.getGameWithPlayers(gameId),
-    ]);
+    const [user, game] = await Promise.all([]);
     if (!game || !this.canJoinGame(game)) {
       throw new NotFoundException(
killedBy: GameService joinGame should successfully join a game
statusReason: NotFoundException: Game with id game123 not found or already full : no player(s) inside

[Killed] BlockStatement
src/game/service/game.service.ts:74:43
       this.userService.findAndUpdatePlayerSocket(email, socketId),
       this.getGameWithPlayers(gameId),
     ]);
-    if (!game || !this.canJoinGame(game)) {
-      throw new NotFoundException(
-        `Game with id ${gameId} not found or already full : ${!game?.players.length ? 'no' : game?.players.length} player(s) inside`,
-      );
-    }
+    if (!game || !this.canJoinGame(game)) {}
 
     game.players.push(user);
killedBy: GameService joinGame should throw NotFoundException when game is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Game with id game123 not found or already full : no player(s) inside"
Received message: "Cannot read properties of null (reading 'players')"

      119 |         }
      120 |       }
    > 121 |       game.players.push(user);

[Killed] LogicalOperator
src/game/service/game.service.ts:74:9
       this.userService.findAndUpdatePlayerSocket(email, socketId),
       this.getGameWithPlayers(gameId),
     ]);
-    if (!game || !this.canJoinGame(game)) {
+    if (!game && !this.canJoinGame(game)) {
       throw new NotFoundException(
         `Game with id ${gameId} not found or already full : ${!game?.players.length ? 'no' : game?.players.length} player(s) inside`,
killedBy: GameService joinGame should throw NotFoundException when game is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Game with id game123 not found or already full : no player(s) inside"
Received message: "Cannot read properties of null (reading 'players')"

      270 |     } else {
      271 |       stryCov_9fa48("146");

[Killed] ConditionalExpression
src/game/service/game.service.ts:100:9
     email: string,
   ): { move: IValidMove; game: GameDocument } {
     const gameToUpdate = game;
-    if (!gameToUpdate) {
+    if (true) {
       throw new GameNotFoundException();
     }
killedBy: GameService makeMove should process a valid move successfully
statusReason: GameNotFoundException: Game not found

[Killed] ConditionalExpression
src/game/service/game.service.ts:106:9
 
     const madeMove = this.engine.makeMove(gameToUpdate.id, move);
 
-    if (!this.isLegalMove(madeMove)) {
+    if (true) {
       throw new IllegalMoveException();
     }
killedBy: GameService makeMove should process a valid move successfully
statusReason: IllegalMoveException: Illegal move

[Killed] ConditionalExpression
src/game/service/game.service.ts:151:50
     winnerEmail: string,
   ): GameDocument {
     const gameToUpdate = game;
-    const winner = game.players.find((player) => player.email === winnerEmail);
+    const winner = game.players.find((player) => false);
     const { fen, status } = moveDetails;
     gameToUpdate.fen = fen;
killedBy: GameService buildEndPayload should set winner when status is checkmate and winner exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "test", "elo": 3000, "email": "winner@gmail.com", "gamertag": "test"}
Received: undefined

[Killed] LogicalOperator
src/game/service/game.service.ts:155:20
     const { fen, status } = moveDetails;
     gameToUpdate.fen = fen;
     gameToUpdate.status = status;
-    if (winner && (status === 'checkmate' || status === 'resign')) {
+    if (winner && (status === 'checkmate' && status === 'resign')) {
       gameToUpdate.winner = winner;
     }
killedBy: GameService buildEndPayload should set winner when status is checkmate and winner exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "test", "elo": 3000, "email": "winner@gmail.com", "gamertag": "test"}
Received: undefined

[Killed] ConditionalExpression
src/game/service/game.service.ts:155:9
     const { fen, status } = moveDetails;
     gameToUpdate.fen = fen;
     gameToUpdate.status = status;
-    if (winner && (status === 'checkmate' || status === 'resign')) {
+    if (false) {
       gameToUpdate.winner = winner;
     }
killedBy: GameService buildEndPayload should set winner when status is checkmate and winner exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "test", "elo": 3000, "email": "winner@gmail.com", "gamertag": "test"}
Received: undefined

[Killed] BlockStatement
src/game/service/game.service.ts:165:74
    * Retrieves a game with its players.
    * @param gameId The ID of the game.
    */
-  async getGameWithPlayers(gameId: string): Promise<GameDocument | null> {
-    return this.gameModel.findOne({ id: gameId }).populate('players').exec();
-  }
+  async getGameWithPlayers(gameId: string): Promise<GameDocument | null> {}
 
   /**
killedBy: GameService should findAndUpdatePlayerSocket ?
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": "game1"}

Number of calls: 0

[Killed] BlockStatement
src/game/service/game.service.ts:173:30
    * Undoes the last move made in the game.
    * @param game The game object.
    */
-  undoMove(game: Game): void {
-    this.engine.undoMove(game.id);
-  }
+  undoMove(game: Game): void {}
 
   /**
killedBy: GameService undoMove should call engine undoMove
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "game123"

Number of calls: 0

[Killed] BlockStatement
src/game/service/game.service.ts:181:48
    * Checks if a move is legal.
    * @param move The move to check.
    */
-  isLegalMove(move: IMove): move is IValidMove {
-    return !!move.valid && !!move.details;
-  }
+  isLegalMove(move: IMove): move is IValidMove {}
 
   /**
killedBy: GameService isLegalMove should be true if move is valid and contains details
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/game/service/game.service.ts:182:12
    * @param move The move to check.
    */
   isLegalMove(move: IMove): move is IValidMove {
-    return !!move.valid && !!move.details;
+    return true;
   }
 
killedBy: GameService isLegalMove should be false if move has no details
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/game/service/game.service.ts:189:52
    * Checks if a game can be joined.
    * @param game The game object.
    */
-  private canJoinGame(game: GameDocument): boolean {
-    return game.players.length < 2 && game.status === 'pending';
-  }
+  private canJoinGame(game: GameDocument): boolean {}
 }
 
killedBy: GameService joinGame should successfully join a game
statusReason: NotFoundException: Game with id game123 not found or already full : 1 player(s) inside

[Killed] EqualityOperator
src/game/service/game.service.ts:190:39
    * @param game The game object.
    */
   private canJoinGame(game: GameDocument): boolean {
-    return game.players.length < 2 && game.status === 'pending';
+    return game.players.length < 2 && game.status !== 'pending';
   }
 }
killedBy: GameService joinGame should successfully join a game
statusReason: NotFoundException: Game with id game123 not found or already full : 1 player(s) inside

[Killed] EqualityOperator
src/game/service/game.service.ts:190:12
    * @param game The game object.
    */
   private canJoinGame(game: GameDocument): boolean {
-    return game.players.length < 2 && game.status === 'pending';
+    return game.players.length <= 2 && game.status === 'pending';
   }
 }
killedBy: GameService joinGame should throw NotFoundException when game is full
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
