[Killed] BlockStatement
src/game.event/service/game.event.service.ts:17:53
    * @param client The socket client of the current player.
    * @param game The game object.
    */
-  async emitGameCreated(client: Socket, game: Game) {
-    await client.join(game.id);
-    client.emit(SocketMessages.GAME_CREATED, game);
-  }
+  async emitGameCreated(client: Socket, game: Game) {}
 
   /**
killedBy: GameEventService emitGameCreated should join room and emit game created event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "game123"

Number of calls: 0

[Killed] BlockStatement
src/game.event/service/game.event.service.ts:34:5
     game: Game,
     opponentSocketId: string,
     gameId: string,
-  ) {
-    await client.join(gameId);
-    client.emit(SocketMessages.PLAYER_JOINED, {
-      gameId,
-      status: 'playing',
-    });
-    client
-      .to(opponentSocketId)
-      .emit(SocketMessages.GAME_STARTED, { ...game, status: 'playing' });
-  }
+  ) {}
 
   emitError(client: Socket, msg: string) {
killedBy: GameEventService emitGameJoined should join room and emit appropriate events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "socket123"

Number of calls: 0

[Killed] BlockStatement
src/game.event/service/game.event.service.ts:55:61
    * @param move The move made by the current player.
    * @param opponent The opponent user.
    */
-  emitMoveMade(client: Socket, move: IMove, opponent: User) {
-    client.to(opponent.currentSocketId).emit(SocketMessages.MOVE_MADE, {
-      ...move.details,
-      currentPlayer: opponent.currentSocketId,
-    });
-
-    client.emit(SocketMessages.MOVE_MADE, {
-      ...move.details,
-      currentPlayer: opponent.currentSocketId,
-    });
-  }
+  emitMoveMade(client: Socket, move: IMove, opponent: User) {}
 
   /**
killedBy: GameEventService emitMoveMade should emit move to both players
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test"

Number of calls: 0

[Killed] BlockStatement
src/game.event/service/game.event.service.ts:79:5
     details: IValidMove['details'],
     opponent: User,
     gameId: string,
-  ) {
-    client.to(opponent.currentSocketId).emit(SocketMessages.GAME_OVER, {
-      ...details,
-      currentPlayer: opponent.currentSocketId,
-    });
-
-    client.emit(SocketMessages.GAME_OVER, {
-      ...details,
-      currentPlayer: opponent.currentSocketId,
-    });
-
-    await client.leave(gameId);
-    client.to(opponent.currentSocketId).socketsLeave(gameId);
-  }
+  ) {}
 
   /**
killedBy: GameEventService emitGameOver should emit game over to both players
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test"

Number of calls: 0

[Survived] ObjectLiteral
src/game.event/service/game.event.service.ts:80:72
     opponent: User,
     gameId: string,
   ) {
-    client.to(opponent.currentSocketId).emit(SocketMessages.GAME_OVER, {
-      ...details,
-      currentPlayer: opponent.currentSocketId,
-    });
+    client.to(opponent.currentSocketId).emit(SocketMessages.GAME_OVER, {});
 
     client.emit(SocketMessages.GAME_OVER, {

[Killed] BlockStatement
src/game.event/service/game.event.service.ts:100:65
    * @param winner The user who won the game.
    * @param gameId The ID of the game.
    */
-  async emitLeave(client: Socket, winner: User, gameId: string) {
-    await client.leave(gameId);
-    client.to(winner.currentSocketId).emit(SocketMessages.GAME_OVER, {
-      winner,
-      status: 'resign',
-    });
-    client.to(winner.currentSocketId).socketsLeave(gameId);
-  }
+  async emitLeave(client: Socket, winner: User, gameId: string) {}
 }
 
killedBy: GameEventService emitLeave should emit game over with resign status to winner
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "winner123"

Number of calls: 0
