[Killed] ConditionalExpression
src/user/service/user.service.ts:23:9
     socketId: string,
   ): Promise<User> {
     const user = await this.userModel.findOne({ email }).exec();
-    if (!user) {
+    if (false) {
       throw new NotFoundException(`User with email ${email} not found`);
     }
killedBy: UserService should throw NotFoundException if user not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "User with email winner@gmail.com not found"
Received message: "Cannot set properties of null (setting 'currentSocketId')"

      84 |         }
      85 |       }
    > 86 |       user.currentSocketId = socketId;

[Killed] BlockStatement
src/user/service/user.service.ts:36:60
    * @param players
    * @param email
    */
-  getOpponent(players: User[], email: string): User | null {
-    if (players.map((player) => player.email).includes(email)) {
-      return players.find((player) => player.email !== email) ?? null;
-    }
-    return null;
-  }
+  getOpponent(players: User[], email: string): User | null {}
 }
 
killedBy: UserService should return a players opponent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "Vitani", "elo": 2, "email": "loser@gmail.com", "gamertag": "test"}
Received: undefined

[Killed] ConditionalExpression
src/user/service/user.service.ts:37:9
    * @param email
    */
   getOpponent(players: User[], email: string): User | null {
-    if (players.map((player) => player.email).includes(email)) {
+    if (false) {
       return players.find((player) => player.email !== email) ?? null;
     }
killedBy: UserService should return a players opponent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "Vitani", "elo": 2, "email": "loser@gmail.com", "gamertag": "test"}
Received: null

[Killed] LogicalOperator
src/user/service/user.service.ts:38:14
    */
   getOpponent(players: User[], email: string): User | null {
     if (players.map((player) => player.email).includes(email)) {
-      return players.find((player) => player.email !== email) ?? null;
+      return players.find(player => player.email !== email) && null;
     }
     return null;
killedBy: UserService should return a players opponent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"currentSocketId": "Vitani", "elo": 2, "email": "loser@gmail.com", "gamertag": "test"}
Received: null
